vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC864_DFP.pdsc
    <condition id="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=LPC864.internal_condition">
      <require condition="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <accept condition="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.lpc_crc_adapter.condition_id">
      <require condition="allOf.driver.lpc_crc, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_crc, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.lpc_gpio_adapter.condition_id">
      <require condition="allOf.driver.syscon, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.syscon, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="syscon"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.lpc_i2c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.lpc_i2c, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.lpc_i2c, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=LPC864.internal_condition">
      <require condition="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light"/>
    </condition>
    <condition id="component.mem_manager_legacy.condition_id">
      <require condition="allOf.component.mem_manager, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.component.mem_manager, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=LPC864.internal_condition"/>
    </condition>
    <condition id="component.miniusart_adapter.condition_id">
      <require condition="allOf.driver.lpc_miniusart, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_miniusart, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.mrt_adapter.condition_id">
      <require condition="allOf.driver.mrt, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mrt, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="component.pwm_ftm_adapter.condition_id">
      <require condition="allOf.driver.ftm, device=LPC864.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=component.software_rng_adapter, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.software_rng_adapter, device=LPC864.internal_condition">
      <require condition="anyOf.component.software_rng_adapter.internal_condition"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="anyOf.component.software_rng_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="component.rt_gpio_adapter.condition_id">
      <require condition="allOf.driver.lpc_gpio, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_gpio, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
