vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC864_DFP.pdsc
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ftm_adapter, driver.ftm, allOf=component.mrt_adapter, driver.mrt, component.lists, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.ftm_adapter, driver.ftm, allOf=component.mrt_adapter, driver.mrt, component.lists, driver.common, device=LPC864.internal_condition">
      <require condition="anyOf.allOf=component.ftm_adapter, driver.ftm, allOf=component.mrt_adapter, driver.mrt.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.ftm_adapter, driver.ftm, allOf=component.mrt_adapter, driver.mrt.internal_condition">
      <accept condition="allOf.component.ftm_adapter, driver.ftm.internal_condition"/>
      <accept condition="allOf.component.mrt_adapter, driver.mrt.internal_condition"/>
    </condition>
    <condition id="allOf.component.ftm_adapter, driver.ftm.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ftm_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ftm"/>
    </condition>
    <condition id="allOf.component.mrt_adapter, driver.mrt.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=LPC864.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="device_id.LPC864.internal_condition">
      <accept Dname="LPC864M201JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC864M201JHI33" Dvendor="NXP:11"/>
      <accept Dname="LPC864M201JHI48" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=LPC864.internal_condition">
      <require condition="device_id.LPC864.internal_condition"/>
    </condition>
    <condition id="device_ids.LPC864.internal_condition">
      <accept Dname="LPC864M201JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC864M201JHI33" Dvendor="NXP:11"/>
      <accept Dname="LPC864M201JHI48" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=LPC864.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.LPC864.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=LPC864.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.LPC864.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=LPC864.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.LPC864.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="LPC864_system"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="LPC864_header"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.ftm.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.LPC864.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition">
      <require condition="anyOf.driver.lpc_i2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpc_i2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
