vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC864_DFP.pdsc
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.i3c_dma.condition_id">
      <require condition="allOf.driver.i3c, driver.lpc_dma, device=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.i3c, driver.lpc_dma, device=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.LPC864.internal_condition"/>
    </condition>
    <condition id="driver.iap.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.driver.common, driver.inputmux_connections, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.inputmux_connections, device_id=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
      <require condition="device_id.LPC864.internal_condition"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_acomp.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_adc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_crc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_dma.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_gpio.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_i2c.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_iocon_lite.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_minispi.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lpc_miniusart.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.mrt.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.driver.common, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.power.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.swm.condition_id">
      <require condition="allOf.driver.common, driver.swm_connections, device_id=LPC864.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.swm_connections, device_id=LPC864.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="swm_connections"/>
      <require condition="device_id.LPC864.internal_condition"/>
    </condition>
    <condition id="driver.swm_connections.condition_id">
      <require condition="allOf.device=LPC864.internal_condition"/>
    </condition>
    <condition id="driver.syscon.condition_id">
      <require condition="allOf.driver.common, driver.syscon_connections, device_id=LPC864.internal_condition"/>
    </condition>
