vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC864_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy" Cversion="1.0.0" condition="component.mem_manager_legacy.condition_id">
      <description>Component mem_manager_legacy</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light" Cversion="1.0.0" condition="component.mem_manager_light.condition_id">
      <description>Component mem_manager_light</description>
      <files>
        <file category="sourceC" name="components/mem_manager/fsl_component_mem_manager_light.c" projectpath="component/mem_manager"/>
        <file category="include" name="components/mem_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="miniusart_adapter" Cversion="1.0.0" condition="component.miniusart_adapter.condition_id">
      <description>Component miniusart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_miniusart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter" Cversion="1.0.0" condition="component.mrt_adapter.condition_id">
      <description>Component mrt_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_MRT
#define TIMER_PORT_TYPE_MRT 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_mrt.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm_ftm_adapter" Cversion="1.0.0" condition="component.pwm_ftm_adapter.condition_id">
      <description>Component pwm_ftm_adapter</description>
      <files>
        <file category="header" name="components/pwm/fsl_adapter_pwm.h" projectpath="component/pwm"/>
        <file category="sourceC" name="components/pwm/fsl_adapter_pwm_ftm.c" projectpath="component/pwm"/>
        <file category="include" name="components/pwm/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset_adapter" Cversion="1.0.0" condition="component.reset_adapter.condition_id">
      <description>Component reset_adapter</description>
      <files>
        <file category="header" name="components/reset/fsl_adapter_reset.h" projectpath="component/reset"/>
        <file category="sourceC" name="components/reset/fsl_adapter_reset.c" projectpath="component/reset"/>
        <file category="include" name="components/reset/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface" Cversion="1.0.0" condition="component.rng_adapter_interface.condition_id">
      <description>Component rng_adapter_interface</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h" projectpath="component/rng"/>
        <file category="include" name="components/rng/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rnga_adapter" Cversion="1.0.0" condition="component.rnga_adapter.condition_id">
      <description>Component rnga_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_rnga.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rt_gpio_adapter" Cversion="1.0.1" condition="component.rt_gpio_adapter.condition_id">
      <description>Component rt_gpio_adapter</description>
      <files>
        <file category="header" name="components/gpio/fsl_adapter_gpio.h" projectpath="component/gpio"/>
        <file category="sourceC" name="components/gpio/fsl_adapter_rt_gpio.c" projectpath="component/gpio"/>
        <file category="include" name="components/gpio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_crc_adapter" Cversion="1.0.0" condition="component.software_crc_adapter.condition_id">
      <description>Component software_crc_adapter</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h" projectpath="component/crc"/>
        <file category="sourceC" name="components/crc/fsl_adapter_software_crc.c" projectpath="component/crc"/>
        <file category="include" name="components/crc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="component.software_rng_adapter.condition_id">
      <description>Component software_rng_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC864_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device LPC864_cmsis</description>
      <files>
        <file category="header" name="devices/LPC864/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/LPC864/LPC864.h" projectpath="device"/>
        <file category="header" name="devices/LPC864/LPC864_features.h" projectpath="device"/>
        <file category="header" name="devices/LPC864/LPC864_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/LPC864/periph3/PERI_ACOMP.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_ADC.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_CRC.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_DMA.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_FLASH_CTRL.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_FTM.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_GPIO.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_I2C.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_I3C.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_INPUTMUX.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_IOCON.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_MRT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_PINT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_PMU.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_SPI.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_SWM.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_SYSCON.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_USART.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_WKT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC864/periph3/PERI_WWDT.h" projectpath="device/periph3"/>
        <file category="include" name="devices/LPC864/"/>
        <file category="include" name="devices/LPC864/periph3/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="doc" name="devices/LPC864/template/device.RTE_dummy.txt"/>
        <file category="include" name="devices/LPC864/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="LPC864_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device LPC864_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=LPC864.condition_id" category="linkerScript" attr="config" name="devices/LPC864/arm/LPC864_flash.scf" version="1.0.0" projectpath="LPC864/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=LPC864.condition_id" category="linkerScript" attr="config" name="devices/LPC864/arm/LPC864_ram.scf" version="1.0.0" projectpath="LPC864/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC864.condition_id" category="linkerScript" attr="config" name="devices/LPC864/gcc/LPC864_flash.ld" version="1.0.0" projectpath="LPC864/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC864.condition_id" category="linkerScript" attr="config" name="devices/LPC864/gcc/LPC864_ram.ld" version="1.0.0" projectpath="LPC864/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC864.condition_id" category="linkerScript" attr="config" name="devices/LPC864/iar/LPC864_flash.icf" version="1.0.0" projectpath="LPC864/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC864.condition_id" category="linkerScript" attr="config" name="devices/LPC864/iar/LPC864_ram.icf" version="1.0.0" projectpath="LPC864/iar"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device LPC864_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/LPC864/iar/startup_LPC864.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/LPC864/gcc/startup_LPC864.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/LPC864/arm/startup_LPC864.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC864_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device LPC864_system</description>
      <files>
        <file category="sourceC" name="devices/LPC864/system_LPC864.c" projectpath="device"/>
        <file category="header" name="devices/LPC864/system_LPC864.h" projectpath="device"/>
        <file category="include" name="devices/LPC864/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.3.4" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC864/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="sourceC" name="devices/LPC864/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/LPC864/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
