vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC864_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ftm" Cversion="2.7.2" condition="driver.ftm.condition_id">
      <description>FTM Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_ftm.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC864/drivers/fsl_ftm.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxas21002cq" Cversion="1.0.0" condition="driver.fxas21002cq.condition_id">
      <description>Driver fxas21002cq</description>
      <files>
        <file category="header" name="components/sensor/fxas21002cq/fsl_fxas.h" projectpath="gyroscope"/>
        <file category="sourceC" name="components/sensor/fxas21002cq/fsl_fxas.c" projectpath="gyroscope"/>
        <file category="include" name="components/sensor/fxas21002cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxls8974cf" Cversion="1.0.0" condition="driver.fxls8974cf.condition_id">
      <description>Driver fxls8974cf</description>
      <files>
        <file category="header" name="components/sensor/fxls8974cf/fsl_fxls.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxls8974cf/fsl_fxls.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxls8974cf/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/sensor/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="htu21d" Cversion="1.0.0" condition="driver.htu21d.condition_id">
      <description>Driver htu21d</description>
      <files>
        <file category="header" name="components/sensor/htu21d/fsl_htu21d.h" projectpath="htu"/>
        <file category="sourceC" name="components/sensor/htu21d/fsl_htu21d.c" projectpath="htu"/>
        <file category="include" name="components/sensor/htu21d/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c" Cversion="2.14.2" condition="driver.i3c.condition_id">
      <description>I3C Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_i3c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_i3c.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_dma" Cversion="2.1.8" condition="driver.i3c_dma.condition_id">
      <description>I3C DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_i3c_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC864/drivers/fsl_i3c_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iap" Cversion="2.0.7" condition="driver.iap.condition_id">
      <description>IAP Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_iap.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_iap.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="icm42688p" Cversion="1.0.0" condition="driver.icm42688p.condition_id">
      <description>Driver icm42688p</description>
      <files>
        <file category="header" name="components/sensor/icm42688p/fsl_icm42688p.h" projectpath="icm42688p"/>
        <file category="sourceC" name="components/sensor/icm42688p/fsl_icm42688p.c" projectpath="icm42688p"/>
        <file category="include" name="components/sensor/icm42688p/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.9" condition="driver.inputmux.condition_id">
      <description>INPUTMUX Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_inputmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_inputmux.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.0" condition="driver.inputmux_connections.condition_id">
      <description>Inputmux_connections Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_inputmux_connections.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_acomp" Cversion="2.1.0" condition="driver.lpc_acomp.condition_id">
      <description>LPC_ACOMP Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_acomp.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_acomp.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.6.0" condition="driver.lpc_adc.condition_id">
      <description>ADC Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_adc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_adc.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc" Cversion="2.1.1" condition="driver.lpc_crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.5.3" condition="driver.lpc_dma.condition_id">
      <description>DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC864/drivers/fsl_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.7" condition="driver.lpc_gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.2.1" condition="driver.lpc_i2c.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_i2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_i2c.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iocon" Cversion="2.0.2" condition="driver.lpc_iocon_lite.condition_id">
      <description>IOCON Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_iocon.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.0.8" condition="driver.lpc_minispi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.5.2" condition="driver.lpc_miniusart.condition_id">
      <description>USART Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_usart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_usart.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lsm6dso" Cversion="1.0.0" condition="driver.lsm6dso.condition_id">
      <description>Driver lsm6dso</description>
      <files>
        <file category="header" name="components/sensor/lsm6dso/fsl_lsm.h" projectpath="tilt_pedo"/>
        <file category="sourceC" name="components/sensor/lsm6dso/fsl_lsm.c" projectpath="tilt_pedo"/>
        <file category="include" name="components/sensor/lsm6dso/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="max30101" Cversion="1.0.0" condition="driver.max30101.condition_id">
      <description>Driver max30101</description>
      <files>
        <file category="header" name="components/sensor/max30101/fsl_max.h" projectpath="heartrate"/>
        <file category="sourceC" name="components/sensor/max30101/fsl_max.c" projectpath="heartrate"/>
        <file category="include" name="components/sensor/max30101/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8451q" Cversion="1.0.0" condition="driver.mma8451q.condition_id">
      <description>Driver mma8451q</description>
      <files>
        <file category="header" name="components/sensor/mma8451q/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8451q/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8451q/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mma8652fc" Cversion="1.0.0" condition="driver.mma8652fc.condition_id">
      <description>Driver mma8652fc</description>
      <files>
        <file category="header" name="components/sensor/mma8652fc/fsl_mma.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/mma8652fc/fsl_mma.c" projectpath="accel"/>
        <file category="include" name="components/sensor/mma8652fc/"/>
      </files>
    </component>
