vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC864_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt" Cversion="2.0.5" condition="driver.mrt.condition_id">
      <description>MRT Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_mrt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_mrt.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nmh1000" Cversion="1.0.0" condition="driver.nmh1000.condition_id">
      <description>Driver nmh1000</description>
      <files>
        <file category="header" name="components/sensor/nmh1000/fsl_nmh1000.h" projectpath="nmh1000"/>
        <file category="sourceC" name="components/sensor/nmh1000/fsl_nmh1000.c" projectpath="nmh1000"/>
        <file category="include" name="components/sensor/nmh1000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="p3t1755" Cversion="2.0.0" condition="driver.p3t1755.condition_id">
      <description>Driver p3t1755</description>
      <files>
        <file category="header" name="components/sensor/p3t1755/fsl_p3t1755.h" projectpath="component/p3t1755"/>
        <file category="sourceC" name="components/sensor/p3t1755/fsl_p3t1755.c" projectpath="component/p3t1755"/>
        <file category="include" name="components/sensor/p3t1755/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pint" Cversion="2.2.0" condition="driver.pint.condition_id">
      <description>PINT Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_pint.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_pint.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="2.1.0" condition="driver.power.condition_id">
      <description>Power driver</description>
      <files>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_power.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC864/drivers/fsl_power.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.4.0" condition="driver.reset.condition_id">
      <description>Reset Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_reset.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC864/drivers/fsl_reset.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="swm" Cversion="2.1.2" condition="driver.swm.condition_id">
      <description>SWM Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_swm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_swm.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="swm_connections" Cversion="2.0.0" condition="driver.swm_connections.condition_id">
      <description>swm_connections Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_swm_connections.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="syscon" Cversion="2.0.1" condition="driver.syscon.condition_id">
      <description>SYSCON Driver</description>
      <files>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_syscon.c" projectpath="drivers"/>
        <file category="header" name="devices/LPC864/drivers/fsl_syscon.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="syscon_connections" Cversion="2.0.0" condition="driver.syscon_connections.condition_id">
      <description>syscon_connections Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_syscon_connections.h" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsl2561" Cversion="1.0.0" condition="driver.tsl2561.condition_id">
      <description>Driver tsl2561</description>
      <files>
        <file category="header" name="components/sensor/tsl2561/fsl_tsl2561.h" projectpath="tsl"/>
        <file category="sourceC" name="components/sensor/tsl2561/fsl_tsl2561.c" projectpath="tsl"/>
        <file category="include" name="components/sensor/tsl2561/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wkt" Cversion="2.0.2" condition="driver.wkt.condition_id">
      <description>WKT Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_wkt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_wkt.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wwdt" Cversion="2.1.10" condition="driver.wwdt.condition_id">
      <description>WWDT Driver</description>
      <files>
        <file category="header" name="devices/LPC864/drivers/fsl_wwdt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/LPC864/drivers/fsl_wwdt.c" projectpath="drivers"/>
        <file category="include" name="devices/LPC864/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/middleware.baremetal_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/LPC864/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/LPC864/utilities/fsl_sbrk.c" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="header" name="devices/LPC864/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/LPC864/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="include" name="devices/LPC864/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="header" name="devices/LPC864/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities/debug_console_lite"/>
        <file category="sourceC" name="devices/LPC864/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities/debug_console_lite"/>
        <file category="include" name="devices/LPC864/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="incbin" Cversion="1.0.0" condition="utility.incbin.condition_id">
      <description>Used to include slave core binary into master core binary.</description>
      <files>
        <file condition="allOf.toolchains=armgcc, mdk.condition_id" category="sourceAsm" name="devices/LPC864/utilities/incbin/fsl_incbin.S" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="header" name="devices/LPC864/utilities/str/fsl_str.h" projectpath="utilities/str"/>
        <file category="sourceC" name="devices/LPC864/utilities/str/fsl_str.c" projectpath="utilities/str"/>
        <file category="include" name="devices/LPC864/utilities/str/"/>
      </files>
    </component>
  </components>
</package>